## Описание задания
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам.
Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.
При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Пошаговое решение

1) Предлагаем ввести предложение, вводим массив строк, заполняем его словами из предложения, разделяя их пробелами при помощи метода Split.

System.Console.WriteLine("Введите любое предложение");

string[] input  = Console.ReadLine()!.Split().ToArray();

2) Используя цикл for, проходимся по всему массиву, все элементы, содержащие меньше 4 символов, сдвигаем к началу массива.


int counter = 0;

for (int i = 0; i < input.Length; i++)

  {

    if (input[i].Length < 4)
    {
      input[counter] = input[i];
      counter++;
    }
  }

3) Вводим новый массив строк output с длиной, равной количеству элементов первого массива, имеющих длину меньше 4 символов. Используя цикл for, заполняем его нужными нам элементами.

string[] output = new string[counter];

for (int i = 0; i < counter; i++) output[i] = input[i];

4) Выводим новый массив в консоль через запятую, используя конструкцию string.Join.

System.Console.WriteLine("Набор слов, содержащих 3 и меньше символов: ");
System.Console.Write("[");
System.Console.Write($"{string.Join(", ", output)}");
System.Console.Write("]");

## Алгоритм
